.tsung/tsung_test2.xml
<?xml version="1.0"?><!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0" backend="fullstats">
 
<!-- Client side setup -->
<clients>
<client host="tsung1" weight="1" maxusers="1000">
<ip value="192.168.100.9"></ip>
</client>
</clients>
 
<!-- Server side setup -->
<servers>
<server host="54.228.106.218" port="8080" type="tcp"></server>
</servers>
 
<!-- to start os monitoring (cpu, network, memory). Use an erlang
agent on the remote machine or SNMP. erlang is the default -->
<monitoring>
<monitor host="myserver" type="snmp"></monitor>
</monitoring>
 
<load>
<!-- several arrival phases can be set: for each phase, you can set
the mean inter-arrival time between new clients and the phase
duration -->

<arrivalphase phase="1" duration="120" unit="second">
<users interarrival="40" unit="second"></users>
</arrivalphase>
<!--
<user session="rec20131113-1411" start_time="10" unit="second"></user>
<user session="rec20131113-1411" start_time="10" unit="second"></user>    
-->
</load>
 
<options>
<option type="ts_http" name="user_agent">
<user_agent probability="100">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
</option>
</options>
 
<!-- start a session for a http user. the probability is the
frequency of this type os session. The sum of all session's
probabilities must be 100 -->
 
<sessions>
<session name='rec20131113-1411' probability='100'  type='ts_http'>
<request><http url='http://54.228.106.218:8080/Uploader/uimage' version='1.1'  contents_from_file='/root/.tsung/tsung_recorder20131113-1411-1.bin' content_type='multipart/form-data; boundary=---------------------------69004898910245043621172514558' method='POST'></http></request>
</session>
</sessions>
 
</tsung>